Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་འཕོ་བ་མེད་པའོ། །ཆོས་ཀྱི་རང་བཞིན་གྱིས་འཇིག་པ་མེད་པའི་ཆོས་ཉིད་ཡིན་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་འཇིག་པ་མེད་པའོ།
en: Those tathāgatas are not destroyed because the indestructible true nature is the nature of phenomena.

source: །ངག་གི་ལམ་ཐམས་ཅད་ལས་ཡོངས་སུ་འདས་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ནི་མཚན་ཉིད་གཅིག་པའོ།
en: All those tathāgatas have a single characteristic because of their transcendence of all paths of speech.

source: །ཆོས་ཀྱི་མཚན་ཉིད་ཀྱི་རང་བཞིན་གྱི་མཐར་ཐུག་པས། དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་མཚན་ཉིད་མི་མངའ་བའོ།
en: Those tathāgatas do not have characteristics because they are the termination of the nature of the characteristics of phenomena.

source: །རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གཏན་ཞི་བའི་བདེ་བས་ཀུན་ཏུ་རྣམ་པར་གནོན་པ་འདི་དེ་བཞིན་གཤེགས་པའི་བསམ་གཏན་གྱི་དཀྱིལ་འཁོར་སྣང་བས་ཤིན་ཏུ་རྒྱ་ཆེར་བྱེད་དོ། །ཤིན་ཏུ་ཡངས་པར་བྱེད་དོ། །ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །རྟོགས་པར་བྱེད་དོ། །མཉམ་པར་བྱེད་དོ། །མངོན་པར་སྒྲུབ་བོ། །གཞི་སྙོམས་པར་བྱེད་དོ། །རབ་ཏུ་འཇུག་གོ།
en: “Noble one, I perceive all tathāgatas in that way, and through the radiance of the tathāgatas’ domain of dhyāna, I increase this bodhisattva liberation called complete subjugation through the bliss of the peace of śamatha

source: རྣམ་པར་འཕེལ་བར་བྱེད་དོ། །ངེས་པར་སེམས་སོ། །ཉེ་བར་རྟོག་གོ །དྲན་པར་བྱེད་དོ། །སྤྱོད་ཡུལ་དུ་བྱེད་དོ། །བརྟན་པར་བྱེད་དོ། །སྣང་བར་བྱེད་དོ། །རབ་ཏུ་བརྗོད་དོ། །རྣམ་པར་དཔྱོད་དོ། །རྣམ་པར་འབྱེད་དོ། །ཚོགས་སུ་བྱེད་དོ།
en: I make it vast, perceive it, realize it, make it even, accomplish it, make it level , enter it, augment it, contemplate it, reflect upon it, am mindful of it, make it my field of practice, make it firm, illuminate it, explain it, divide it, categorize it, unite it, and have conviction in it.

source: །ཡིད་ཆེས་པར་བྱེད་དོ། །ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་རྒྱུ་བ་མེད་པའི་སྙིང་རྗེ་ཆེན་པོ་དེ་ལ་གནས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་ལ་ཡང་དག་པར་སྤྱད་པར་སེམས་རྩེ་གཅིག་ཏུ་བྱ་བའི་ཕྱིར་བསམ་གཏན་དང་པོ་སྒོམ་མོ།
en: “I meditate on the first dhyāna in order to remain in that great compassion in which there is no movement of any thought and in order to have a single-pointed mind for engaging in saving all beings.

source: ཡིད་ཀྱི་ལས་ཐམས་ཅད་ཉེ་བར་ཞི་བར་བྱ་བ་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། མཐུས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བ་ལ་དགའ་བའི་བདེ་བ་ལ་སེམས་རྩེ་གཅིག་ཏུ་བྱ་བའི་ཕྱིར། བསམ་གཏན་གཉིས་པ་སྒོམ་མོ། །འཁོར་བར་ལོག་པར་ཞུགས་པ་ལ་བཏང་སྙོམས་སུ་བྱས་ཏེ།
en: “I meditate on the second dhyāna in order to pacify all mental activity and, through the strength and power of wisdom, to have a one-pointed mind with joy of bliss in gathering all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་རྟོགས་པར་བྱ་བའི་ཕྱིར། བསམ་གཏན་གསུམ་པ་སྒོམ་མོ།
en: “I meditate on the third dhyāna in order to have equanimity toward the distress of saṃsāra and to realize the nature of all beings.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་དང་། སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་བྱ་བའི་ཕྱིར་བསམ་གཏན་བཞི་པ་སྒོམ་མོ།
en: “I meditate on the fourth dhyāna in order to bring an end to the kleśas and suffering of all beings.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་ཤིན་ཏུ་ཡོངས་པར་བྱ་བ་དང་། ཏིང་ངེ་འཛིན་རྒྱ་མཚོ་ཐམས་ཅད་མངོན་པར་སྒྲུབ་པ་ལ་མཁས་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་འཇུག་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་རྩེ་བའི་ཡེ་ཤེས་ཐམས་ཅད་མངོན་པར་ཤེས་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པར་བྱ་བའི་ཕྱིར། སྒོ་ཀུན་ནས་ཆོས་ཀྱི་དབྱིངས་ལ་འཇུག་པའི་ཡེ་ཤེས་ཀྱི་ཚུལ་ཡོངས་སུ་སྦྱོང་ཞིང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་བསམ་གཏན་ཞི་བའི་བདེ་བས་ཀུན་ཏུ་རྣམ་པར་གནོན་པ་འདི་སྒོམ་མོ།
en: “I purify the way of the wisdom that enters the realm of phenomena through every gateway and thus meditate on this bodhisattva liberation called complete subjugation through the bliss of the peace of śamatha in order to increase the domain of aspiration for omniscience, to become skilled in the accomplishment of an ocean of samādhis, to realize the ways of the ocean of all bodhisattva liberations, and to have the higher cognition of all the wisdoms displayed by bodhisattvas.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་རྣམ་པར་ཐར་པ་འདི་སྒོམ་ཞིང་ཐབས་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ།
en: “Noble one, in that way I meditate on this liberation and ripen beings through various methods:

source: འདི་ལྟར་ནུབ་མོ་ཞི་བར་གྱུར་པའི་ཚེ་དགའ་བ་ལ་མོས་པའི་སེམས་ཅན་རྣམས་ཀྱིས་མི་སྡུག་པའི་འདུ་ཤེས་སྐྱེད་དོ། །མི་དགའ་བའི་འདུ་ཤེས་དང་། ཡོངས་སུ་སྐྱོ་བའི་འདུ་ཤེས་དང་། བགེགས་སུ་འགྱུར་བའི་འདུ་ཤེས་དང་། འཆིང་བའི་འདུ་ཤེས་དང་། སྲིན་མོའི་འདུ་ཤེས་དང་། མི་རྟག་པའི་འདུ་ཤེས་དང་། སྡུག་བསྔལ་བའི་འདུ་ཤེས་དང་། བདག་མེད་པའི་འདུ་ཤེས་དང་། རྗེ་མེད་པའི་འདུ་ཤེས་དང་། གཞན་ལ་རག་ལས་པའི་འདུ་ཤེས་དང་། རྒ་ཤིའི་འདུ་ཤེས་དང་། འདོད་པའི་ཡུལ་དང་ལོངས་སྤྱོད་ཐམས་ཅད་ལ་དགའ་བ་མེད་པའི་འདུ་ཤེས་སྐྱེད་དེ།
en: I instill in the beings who enjoy carnal pleasure in the peace of the night the perception of it as ugliness, the perception of it as lack of pleasure, the perception of it as wearying, the perception of it as an obstacle, the perception of it as bondage, the perception of it as a rākṣasī, the perception of impermanence, the perception of suffering, the perception of no self, the perception of no ownership, the perception of dependence on others, the perception of aging and death, and the perception of a lack of joy in all indulgence in desires.

source: སེམས་ཅན་དེ་དག་ཀྱང་སེམས་དེ་ལ་ཡོངས་སུ་སྒོམ་པས། འདོད་པའི་དགའ་བ་ཐམས་ཅད་ལ། མངོན་པར་དགའ་བ་མེད་པས་ཆོས་ལ་མོས་པའི་དགའ་བ་ལ་འཇུག་ཅིང་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་འབྱུང་ངོ་།
en: When those beings meditate on that state of mind, they will take no delight in any indulgence in carnal pleasure and will instead aspire to enjoy the delights of the Dharma and leave home for homelessness.

source: །དེ་དག་དགོན་པ་ལ་གནས་པའི་ཚེ་འང་ཆོས་དང་མཐུན་པའི་དད་པ་ཡོངས་སུ་སྐྱེད་དེ།
en: When they dwell in solitude, I instill in them the faith that accords with the Dharma.

source: སྒྲ་ཆེན་པོ་འཇིགས་པ་མི་སྙན་པའི་སྒྲ་སྐད་ཐམས་ཅད་ཀྱང་ཞི་བར་བྱེད་དོ། །མཚན་མོ་ཞི་བར་གྱུར་པ་ལྷས་སངས་རྒྱས་ཀྱི་ཆོས་ཟབ་མོ་ཡང་ཡང་དག་པར་སྟོན་ཏོ།
en: I cause all loud, frightening, unpleasant sounds to cease, and in the peace of the night I teach the profound Dharma of the buddhas.

source: །སྤང་བ་དང་འཐུན་པའི་རྐྱེན་ཡང་ཉེ་བར་སྟོན་ཏོ།
en: “I gather the conditions necessary for renunciation.

source: །ཁྱིམ་གྱི་སྒོ་ཡང་རྣམ་པར་འབྱེད་དོ།
en: I open the door of the house for their departure.

source: །ལམ་ཡང་ཡོངས་སུ་སྟོན་ཏོ།
en: I show them the path.

source: །སྣང་བས་ཀྱང་མངོན་པར་བྱེད་དོ།
en: I illuminate it.

source: །མུན་པས་ཆོད་པ་ཡང་རྣམ་པར་སེལ་ཏོ།
en: I dispel the darkness.

source: །འཇིགས་པའང་མེད་པར་བྱེད་དོ།
en: I free them from fear.

source: །རབ་ཏུ་བྱུང་བ་ལ་ཡང་ཡང་དག་པར་བསྔགས་པ་བྱེད་དོ།
en: I praise departure from home.

source: །སངས་རྒྱས་ཀྱི་ལེགས་པའང་རྗོད་དོ།
en: I describe the qualities of buddhahood.

source: །ཆོས་ཀྱི་ལེགས་པ་དང་། དགེ་འདུན་གྱི་ལེགས་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་ལེགས་པ་ཡང་རྗོད་དོ།
en: I explain the excellence of the Dharma, the excellence of the saṅgha, and the excellence of the kalyāṇamitra.

source: །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་ལའང་བསྔགས་བ་བྱེད་དོ།
en: I praise going to a kalyāṇamitra.

source: །རིགས་ཀྱི་བུ་ཁོ་མོ་རྣམ་པར་ཐར་པ་འདི་ལ་སྒོམ་ཞིང་སེམས་ཅན་རྣམས་ཀྱི་ཆོས་མ་ཡིན་པའི་འདོད་ཆགས་ཀྱིས་ཞེན་པ་རྣམས་ཀྱི་ཆོས་མ་ཡིན་པའི་འདོད་ཆགས་ཀྱི་ཡོངས་སུ་རྟོག་པ་རྣམས་ཀྱང་མེད་པར་བྱེད་དོ།
en: “Noble one, meditating on this liberation, I eliminate in beings the passion and desire for what is not Dharma, and thoughts of desire for what is not Dharma.

source: །ཚུལ་མ་ཡིན་པའི་འདོད་པས་ནོན་པ་རྣམས་དང་། ལོག་པར་ཡོངས་སུ་རྟོག་པའི་སྤྱོད་ཡུལ་ཅན་རྣམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་དེ་དག་དང་ཡིད་ལ་བྱ་བ་དེ་དག་ཀྱང་མེད་པར་བྱེད་དོ།
en: I dispel the thoughts and notions of those overpowered by inappropriate desires, and those whose conduct comes from wrong thoughts.

source: །སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་མི་སྐྱེ་བ་དང་། སྡིག་ཏོའི་ཡོངས་སུ་རྟོག་པ་སྐྱེས་པར་གྱུར་པ་རྣམས་ཀྱང་མེད་པར་འགྱུར་བའི་རྐྱེན་ཉེ་བར་སྒྲུབ་བོ།
en: “I create the conditions for those who have not developed evil thoughts and bad qualities to not develop them, and for those who think evil thoughts to eliminate them.

source: །དགེ་བའི་ཡོངས་སུ་རྟོག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པ་དང་། སྤྱོད་པ་དང་ལྡན་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སུ་འབྱུང་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་དང་ལྡན་པ་དང་། བྱམས་པའི་ཚུལ་དང་ལྡན་པ་དང་། སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོས་རྒྱས་པར་འགེངས་པ་དང་ལྡན་པ་དང་། ལྷ་དང་མིའི་བདེ་བ་རྣམ་པ་སྣ་ཚོགས་ཡོངས་སུ་བསྐྱེད་པ་དང་། ལྡན་པའི་ཡོངས་སུ་རྟོགས་པ་བསྐྱེད་པ་དང་། སྐྱེས་ནས་ཀྱང་ཚུལ་སྣ་ཚོགས་ཀྱི་རྐྱེན་ཉེ་བར་བསྒྲུབ་པར་བྱེད་པ་ནས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་མཐུན་པའི་རྐྱེན་ཀྱང་ཉེ་བར་སྒྲུབ་པ་བྱེད་དེ།
en: “I create in various ways the supporting conditions for those who have virtuous thoughts, who practice the perfections, who are engaged in good conduct, who are engaged in accomplishing prayers for the arising of omniscient wisdom, who are engaged in the ways of love, who are pervaded by great compassion for beings, who are engaged in creating the various kinds of happiness of devas and humans, and who have given rise to such thoughts, and I create the conditions that support omniscience.

source: རིགས་ཀྱི་བུ་ཁོ་མོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གཏན་ཞི་བའི་བདེ་བས་ཀུན་ཏུ་རྣམ་པར་གནོན་པ་འདི་ཤེས་པར་ཟད་ན། ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱིས་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པ་མཐའ་ཡས་པའི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཡེ་ཤེས་རབ་ཏུ་ཐོབ་པ། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་སྤེལ་བའི་སེམས་དང་ལྡན་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་ཀྱི་མཐུས་སེམས་ཀྱི་སྣང་བ་རབ་ཏུ་ཐོབ་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་ལ་གནས་པའི་སེམས་དང་ལྡན་པ། གནས་ཐམས་ཅད་དུ་སྒྲིབ་པ་མེད་པའི་སེམས་དང་ལྡན་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པའི་སེམས་དང་ལྡན་པ། ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་དུ་ཞུགས་པའི་སེམས་དང་ལྡན་པ།
en: “Noble one, I know only the bodhisattva liberation called complete subjugation through the bliss of the peace of śamatha

source: སངས་རྒྱས་རྒྱ་མཚོ་ཐམས་ཅད་མཐོང་བར་བྱ་བ་ལ་ཞུགས་པའི་སེམས་དང་ལྡན་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡང་དག་པར་གཟུང་བའི་སེམས་དང་ལྡན་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མ་རིག་པའི་མུན་པ་རྣམ་པར་སེལ་བ། འཁོར་བའི་བདེ་བ་ལ་དགའ་ཞིང་སྲེད་པ་ཟད་ཅིང་མཐར་ཕྱིན་པར་འགྱུར་བའི་ལམ་གྱིས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྣང་བ་སྐྱེད་པའི་སེམས་དང་ལྡན་པ། དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: How could I know the conduct or describe the qualities of bodhisattvas who have arisen through completely good bodhisattva conduct and prayers, who have attained the wisdom of the infinite realm of phenomena, who have minds that increase all roots of merit, who have attained illumination of their minds through the power of the wisdom of all the tathāgatas, who have minds that maintain the same scope as that of all the tathāgatas, whose minds are unobscured in all situations, whose minds have perfected the aspiration for omniscience, whose minds perceive the entire ocean of realms, whose minds are focused on the vision of the entire ocean of buddhas, whose minds have received the clouds of the Dharma of all the tathāgatas, who dispel the darkness of ignorance of all beings, and who have minds that have given rise to the illumination of omniscience through the path of the final cessation of delight in and craving for saṃsāra? “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་འདི་ཉིད་ན་ང་དང་ཡང་རྒྱང་མི་རིང་སྟེ། རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་གཡས་རོལ་ཅིག་ན། མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ།
en: Here, not far from me, to the south of Vairocana’s bodhimaṇḍa, there is the goddess of the night named Pramudita­nayana­jagad­virocanā.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་ལས་ལ་བརྩོན་པར་བྱ་བ་དྲིས་ཤིག །དེ་ནས་མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ཀྱིས་དེའི་ཚེ།
en: Go to her and ask her, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གཏན་ཞི་བའི་བདེ་བས་ཀུན་ཏུ་རྣམ་པར་གནོན་པ་འདི་ཉིད་བརྣན་ཏེ། བསྟན་པར་བྱ་བའི་ཕྱིར། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། དུས་རྣམས་ཀུན་ཏུ་བྱུང་བའི་བདེ་གཤེགས་རྣམས།
en: Then at that time, the night goddess Samanta­gambhīra­śrī­vimala­prabhā, in order to emphasize and teach this bodhisattva liberation called complete subjugation through the bliss of the peace of śamatha , recited these verses to Sudhana, the head merchant’s son:

source: །མངོན་དུ་བྱ་བར་མོས་པའི་སེམས་དང་ལྡན།
en: “Those with a mind that aspires to be in the presence Of the sugatas that appear in the three times

source: །དེ་དག་མིག་ཡངས་རྣམ་པར་དག་པར་འགྱུར།
en: Will have a vast and pure eyesight

source: །དེས་ནི་སངས་རྒྱས་རྒྱ་མཚོ་མཐོང་བར་འོང་།
en: And will see an ocean of the buddhas.

source: །རྒྱལ་བའི་སྐུ་གསལ་དྲི་མ་མེད་ལ་ལྟོས།
en: “See the bright, stainless body of the Jina

source: །མཚན་གྱིས་ཡོངས་སུ་རྒྱན་པས་ཤིན་ཏུ་མཛེས།
en: Beautifully adorned by the signs of a great being!

source: །རྒྱལ་བའི་རྣམ་པར་འཕྲུལ་པ་ཆོས་དབྱིངས་རྣམས།
en: See the Jina’s miraculous manifestations

source: སྐད་ཅིག་རེ་རེས་རྒྱས་འགེངས་དེ་ལ་འང་ལྟོས།
en: That in an instant fill the realm of phenomena! “The Sugata, the perfect Buddha, Vairocana

source: །བྱང་ཆུབ་ཤིང་དྲུང་སངས་རྒྱས་གདན་རབ་ལ། །བདེ་གཤེགས་རྣམ་པར་སྣང་མཛད་མངོན་སངས་རྒྱས།
en: Is upon the buddha throne under the Bodhi tree.

source: །ཆོས་དབྱིངས་ཡངས་པ་རྒྱས་མཛད་ཅིང་།
en: He pervades the vast realm of phenomena,

source: །འགྲོ་བའི་བསམ་པ་ཇི་བཞིན་འཁོར་ལོ་བསྐོར།
en: Turning the wheel in accordance with the aspirations of beings.

source: །རྒྱལ་བས་ཆོས་ཉིད་ལུས་མེད་རབ་ཞི་བ།
en: “The Jina has realized the true nature, which is bodiless,

source: །གཉིས་མེད་རང་བཞིན་མེད་པ་ཐུགས་ཆུད་ནས།
en: Complete peace, nondual, with no own nature.

source: །གཟུགས་སྐུ་བཟང་པོ་མཚན་གྱིས་བརྒྱན་པ་ཡིས།
en: His physical body, beautiful and adorned by signs,

source: །འགྲོ་བ་མ་ལུས་བཀང་ཞིང་སྟོན་པ་མཛད།
en: Pervades and teaches in every world without exception.

source: །སངས་རྒྱས་སྐུ་ནི་རྒྱ་ཆེ་བསམ་མི་ཁྱབ།
en: “The Buddha’s body is inconceivably vast.

source: །ཆོས་ཀྱི་དབྱིངས་ཀུན་ཡོངས་སུ་རྒྱས་བཀང་ཞིང་།
en: It fills the entirety of the realm of phenomena.

source: །དེ་ནི་ཀུན་ཏུ་མཉམ་པར་སྣང་བ་སྟེ།
en: It appears equally everywhere,

source: །རྒྱལ་བ་ཐམས་ཅད་ཀུན་ཏུ་སྟོན་པ་མཛད།
en: Revealing all the jinas everywhere. “Bodies of the Buddha, with halos of light,

source: །ཞིང་རྣམས་ཀུན་གྱི་རྡུལ་རབ་ཕྲ་བ་སྙེད། །འོད་ཀྱི་དཀྱིལ་འཁོར་མངའ་བའི་སངས་རྒྱས་སྐུ།
en: As numerous as the atoms in all realms,

source: །ཁ་དོག་བཟང་པོ་གཞན་དང་གཞན་སྣང་བས།
en: Their beautiful color appearing here and there,

source: །ཆོས་དབྱིངས་རྒྱས་པར་སྐད་ཅིག་རེ་རེས་འགེངས།
en: Fill the realm of phenomena in every instant.

source: །རྒྱལ་བའི་བ་སྤུའི་སྒོ་ནས་འོད་ཟེར་སྤྲིན།
en: “Clouds of light rays appear from the Jina’s pores.

source: །རྒྱ་ཆེ་བསམ་ཡས་མི་ཟད་མངོན་འབྱུང་བ།
en: They are vast, inconceivable, and unending.

source: །དེ་དག་འགྲོ་བ་མ་ལུས་འགེངས་བྱེད་ཅིང་།
en: They fill every world without exception

source: །སྲོག་ཆགས་རྣམས་ཀྱི་ཉོན་མོངས་གདུང་བ་སེལ།
en: And dispel the torment of the kleśas in beings.

source: །སངས་རྒྱས་སྤྲུལ་པ་རྒྱ་མཚོ་མི་ཟད་པ།
en: “The Buddha’s inexhaustible ocean of emanations

source: །རྒྱལ་བའི་སྤུ་ཡི་འཁོར་ནས་ཡོངས་སྟོན་ཅིང་།
en: Appear from the circles of the Jina’s pores

source: །ཆོས་དབྱིངས་ཡངས་པ་རྒྱས་པར་ཀུན་བཀང་སྟེ།
en: And spread and fill the vast realm of phenomena,

source: །སྲོག་ཆགས་རྣམས་ཀྱི་སྡུག་བསྔལ་ངན་སོང་སེལ།
en: Dispelling the suffering of beings in the lower realms.

source: །སངས་རྒྱས་གསུང་སྙན་རབ་ཏུ་སྒྲོག་མཛད་པ།
en: “The sound of the Buddha’s voice resounds

source: །དབྱངས་ཀྱི་ཡན་ལག་རྒྱ་མཚོའི་སྒྲ་འོད་ཅན།
en: With the light of an ocean of aspects of speech,

source: །ཆོས་ཆར་ཆེན་པོ་རབ་ཏུ་འབེབས་པ་མཛད།
en: Sending down a great rain of the Dharma,

source: །སྲོག་ཆགས་བྱང་ཆུབ་བསམ་པ་ཡོངས་སུ་སྐྱེད།
en: Causing the aspiration to enlightenment to grow in beings. “He has in the past taken care of those

source: །བསྐལ་པ་རྒྱ་མཚོ་སྤྱད་པ་སྤྱོད་པའི་ཚེ།
en: Practicing bodhisattva conduct during an ocean of kalpas.

source: །འདིས་ནི་སྔན་ཅད་ཡོངས་སུ་གཟུང་མཛད་པ། །དེ་དག་ཀུན་གྱི་རྒྱལ་བ་རྣམ་པར་སྣང་མཛད་པ།
en: They have all seen in all the worlds

source: །ཞིང་རྣམས་ཀུན་ཏུ་གཟུགས་བརྙན་མཚན་ཉིད་མཐོང་།
en: The characteristics of the visual form of the Jina Vairocana.

source: །དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་ཀུན་ཏུ་འབྱུང་།
en: “The Tathāgata has appeared in all worlds

source: །སེམས་ཅན་རེ་རེ་ཀུན་ལའང་མངོན་པར་བཞུགས།
en: In the presence of each and every being

source: །མོས་པའི་ཚུལ་བཞིན་སྤྱོད་ཡུལ་གཞན་དང་གཞན།
en: With this and that conduct according to their aspirations,

source: །དེ་དག་ཁོ་མོས་ཀུན་ཏུ་ཤེས་མི་ནུས།
en: And those are beyond my ability to know.

source: །རྒྱལ་སྲས་དམ་པ་ཐམས་ཅད་མ་ལུས་པར།
en: “All the perfect bodhisattvas without exception

source: །བདེ་གཤེགས་བ་སྤུ་གཅིག་གི་རྩེ་ལས་འབྱུང་།
en: Have appeared from a single pore of the Sugata.

source: །རྣམ་ཐར་དེ་ལ་གང་རྣམས་བསམ་ཡས་པ།
en: That liberation is inconceivable

source: །དེ་དག་ཐམས་ཅད་ཁོ་མོས་ཤེས་མི་ནུས།
en: And is beyond my ability to know.

source: །ཁོ་མོའི་འདབ་ན་གནས་པའི་ལྷ་མོ་འདི།
en: “This goddess who is nearby to me

source: །འཇིག་རྟེན་མགོན་ལ་མངོན་གྱུར་རབ་ཏུ་དགའ།
en: Delights in the presence of the Lord of the World.

source: །མིང་དུ་སྣང་བ་འོད་འཕྲོ་མིག་ཅེས་བྱ།
en: Her name is Jyotirarci­nayanā.

source: །དེ་ལ་བྱང་ཆུབ་སྤྱོད་པ་ཅི་འདྲ་དྲིས།
en: Ask her, what is the practice for enlightenment!”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ཀྱི་དྲུང་ནས་སོང་ངོ་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the night goddess Samanta­gambhīra­śrī­vimala­prabhā, circumambulated the night goddess Samanta­gambhīra­śrī­vimala­prabhā many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the night goddess Samanta­gambhīra­śrī­vimala­prabhā. Pramudita­nayana­jagad­virocanā

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་གི་བྱིན་གྱིས་བརླབས་པ། དགེ་བའི་བཤེས་གཉེན་གྱི།
en: Sudhana, the head merchant’s son, was blessed by the instruction of the kalyāṇamitra;

source: ཚིག་ལ་ནན་ཏན་དུ་བྱ་བའི་སེམས་ཡང་དག་པར་སྐྱེས་པ།
en: his mind practiced the words of the kalyāṇamitra;

source: དགེ་བའི་གཤེས་གཉེན་གྱི་སྨན་པ་ལ་ནད་པ་ལྟ་བུའི་འདུ་ཤེས་ཀྱིས་ཡོངས་སུ་སྤྱད་པའི་སེམས་དང་ལྡན་པ།
en: his mind had the perception of the kalyāṇamitra as a physician and himself as a patient;

source: དགེ་བའི་བཤེས་གཉེན་མཐོང་བ་ཡིད་ལ་བྱེད་པ་མ་འཁྲུགས་པའི་སེམས་དང་ལྡན་པ།
en: his mind was contented by focusing on the vision of the kalyāṇamitra;

source: དགེ་བའི་བཤེས་གཉེན་བལྟ་བ་ལ་བསྒྲིབས་པའི་རི་ཐམས་ཅད་རྣམ་པར་གཏོར་བའི་གླགས་རྙེད་པའི་སེམས་དང་ལྡན་པ།
en: his mind had obtained the opportunity to disperse the mountain of obscurations to the vision of the kalyāṇamitra;

source: དགེ་བའི་བཤེས་གཉེན་མཐོང་བ་ལ་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་སྙིང་རྗེ་ཆེན་པོའི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པ་ཐོབ་པའི་སེམས་དང་ལྡན་པ།
en: his mind had attained, through seeing the kalyāṇamitra, entry into the ocean of the ways of the great compassion that saves all the realms of beings;

source: དགེ་བའི་བཤེས་གཉེན་མཐོང་བ་ལ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོའི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པའི་སེམས་དང་ལྡན་པ་དེ།
en: his mind had attained, through seeing the kalyāṇamitra, the illumination by wisdom of the ocean of the ways of the realm of phenomena.

source: མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མྱིག་འགྲོ་བར་རྣམ་པར་སྣང་བ་གང་ན་བ་དེར་སོང་ངོ་། །དེ་ནས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མྱིག་འགྲོ་བར་རྣམ་པར་སྣང་བས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དེ་བས་ཀྱང་དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དགེ་བའི་རྩ་བའི་ཚོགས་ལས་བྱུང་བས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་ཚོགས་ཆེན་པོ་ལས་བྱུང་བར་བྱིན་གྱིས་བརླབས་སོ། །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་རྣམ་པར་གནོན་པ་ཆེན་པོར་བྱིན་གྱིས་བརླབས་སོ། །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་བརྩོན་འགྲུས་ཀྱི་ལས་འཇུག་པར་དཀའ་བར་བྱིན་གྱིས་བརླབས་སོ། །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་བསྡད་ཅིང་ཤིན་ཏུ་ལེགས་པར་བྱིན་གྱིས་བརླབས་སོ།
en: Thus, he approached the night goddess Pramudita­nayana­jagad­virocanā.

source: །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་ཕྱོགས་མཐའ་དང་དབུས་མེད་པ་ལ་འཇུག་པར་བྱིན་གྱིས་བརླབས་སོ། །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་ཡུན་རིང་པོར་གནས་པས་བྱུང་བར་བྱིན་གྱིས་བརླབས་སོ། །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དོན་མཐའ་ཡས་པ་ཡོངས་སུ་རྫོགས་པའི་རྣམ་པར་དམྱིགས་པ་འབྱུང་བར་བྱིན་གྱིས་བརླབས་སོ། དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་ལམ་གྱི་རྒྱན་མཐའ་དང་དབུས་མེད་པའི་ཚོགས་ཀྱིས་ཡོངས་སུ་གནོན་པར་བྱིན་གྱིས་བརླབས་སོ། །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་སྒོ་ཀུན་ནས་རྣམ་པར་གནོན་པས་བྱུང་བར་བྱིན་གྱིས་བརླབས་སོ།
en: The night goddess Pramudita­nayana­jagad­virocanā, in order to further increase the ripening of his accumulation of the roots of merit through approaching a kalyāṇamitra, blessed approaching a kalyāṇamitra as arising from a great accumulation, blessed going to a kalyāṇamitra as great prowess, blessed approaching a kalyāṇamitra as diligence in actions that is difficult to realize, blessed approaching a kalyāṇamitra as reliance throughout a long time, blessed approaching a kalyāṇamitra as going into centerless and limitless directions, blessed approaching a kalyāṇamitra as the source for dwelling together for a long time, blessed approaching a kalyāṇamitra as the source of perceiving infinite tasks being completed, blessed approaching a kalyāṇamitra as the prowess of an accumulation of centerless and limitless displays of the path, blessed approaching a kalyāṇamitra as prowess through every gateway, and blessed approaching a kalyāṇamitra as the prowess of undeviating arrival.

source: །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་གཡོ་བ་མེད་པར་འོང་བས་རྣམ་པར་གནོན་པར་བྱིན་གྱིས་བརླབས་སོ།
en: Sudhana, the head merchant’s son, approached the night goddess Pramudita­nayana­jagad­virocanā in this way:

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཐམས་ཅད་མཁྱེན་པའི་ཚོགས་ཀྱི་བརྩོན་འགྲུས་ལ་རབ་ཏུ་བརྩོན་པས།
en: approaching a kalyāṇamitra with diligent dedication in the accumulation of omniscience;

source: དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་སྨོན་ལམ་ཆེན་པོ་རྒྱ་མཚོ་མངོན་པར་བསྒྲུབ་པའི་རྣམ་པར་གནོན་པས་དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། སེམས་ཅན་གཅིག་གི་དོན་དུ་ཕྱི་མའི་མཐའི་བསྐལ་པའི་མུར་ཐུག་པར་སྡུག་བསྔལ་ཉམས་སུ་བླང་བའི་ཞེ་ནོན་པས།
en: approaching a kalyāṇamitra with the prowess of accomplishing an ocean of great prayers; approaching a kalyāṇamitra with the resolve to undergo suffering for the sake of a single being until the conclusion of the last future kalpa;

source: དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། རྡུལ་ཤིན་ཏུ་ཕྲ་བ་གཅིག་ལ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་སྒྲ་སྒྲོག་ཅིང་ཡུན་རིང་པོར་གནས་པའི་རྣམ་པར་གནོན་པ་དང་། བརྩོན་འགྲུས་ཆེན་པོའི་གོ་བགོས་པས་དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། ཕྱོགས་རྒྱ་མཚོ་འབྱམ་ཀླས་པ་ཐམས་ཅད་དུ་ཤུགས་ཀྱིས་འགྲོ་བས་དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། བ་སྤུའི་སྦུབས་གཅིག་ཏུ་ཕྱི་མའི་མཐའི་བསྐལ་པར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པས།
en: approaching a kalyāṇamitra with the prowess of remaining for a long time within a single atom, emitting sound throughout the entire realm of phenomena while wearing the armor of diligence; approaching a kalyāṇamitra while moving at great speed through the entire extent of the ocean of directions; approaching a kalyāṇamitra while maintaining all bodhisattva conduct of future kalpas in a single pore of the body;

source: དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་ནས་ཀྱང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་འགེངས་པ་ལ་གནས་པར་བྱ་བས།
en: approaching a kalyāṇamitra with the attainment of bodhisattva conduct and in each instant of mind dwelling in omniscient wisdom;

source: དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱན་དང་། ལམ་ཡོངས་སུ་གནོན་པར་ཞེ་ནོན་པས།
en: approaching a kalyāṇamitra while intent on following the path and the display of miracles of the tathāgatas of the three times;
